app/controllers/ai/assistant_controller.rb

INSERT INTO "ai_conversations" ("user_id", "context", "messages", "created_at", "updated_at") VALUES (1, 'general', '[]', '2026-02-08 12:35:24.287548', '2026-02-08 12:35:24.287548') RETURNING "id"
SELECT "ai_conversations".* FROM "ai_conversations" WHERE "ai_conversations"."user_id" = 1 AND "ai_conversations"."context" = 'general' LIMIT 1
---
    def index
      @conversation = current_user.ai_conversations.find_or_create_by(context: "general")

SELECT "ai_conversations".* FROM "ai_conversations" WHERE "ai_conversations"."user_id" = 1 AND "ai_conversations"."context" = 'general' LIMIT 1
---
    def chat
      @conversation = current_user.ai_conversations.find_or_create_by(context: params[:context] || "general")