app/controllers/exercises_controller.rb

  def index
    @exercises = Exercise.all

    @exercises = @exercises.by_category(params[:category]) if params[:category].present?
    @exercises = @exercises.by_muscle_group(params[:muscle_group]) if params[:muscle_group].present?
    @exercises = @exercises.by_difficulty(params[:difficulty]) if params[:difficulty].present?
    @exercises = @exercises.search(params[:q]) if params[:q].present?

    @exercises = @exercises.order(:name)
---
SELECT "exercises".* FROM "exercises" ORDER BY "exercises"."name" ASC