app/controllers/meal_plans_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 2 ORDER BY "recipes"."name" ASC
---
  def new
    @meal_plan = current_user.meal_plans.build(week_start_date: Date.current.next_week.beginning_of_week)
    @meal_plan.build_days
    @recipes = current_user.recipes.order(:name)