app/controllers/nutrition_controller.rb

SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = 2 AND "meals"."date" = '2026-02-25'
SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = 2 AND "meals"."date" = '2026-02-19'
---
  def index
    @date = begin
      params[:date].present? ? Date.parse(params[:date]) : Date.current
    rescue Date::Error
      Date.current
    end
    @meals = current_user.meals.on_date(@date).includes(meal_foods: :food)

    @nutrition_totals = {
      calories: @meals.sum(&:total_calories),
      protein: @meals.sum(&:total_protein),
      carbs: @meals.sum(&:total_carbs),
      fat: @meals.sum(&:total_fat)
    }

    @calorie_goal = current_user.daily_calorie_goal || current_user.tdee || 2000
    @protein_goal = current_user.protein_goal || 150
    @carb_goal = current_user.carb_goal || 250
    @fat_goal = current_user.fat_goal || 65

    # Weekly chart data
    @weekly_calories = (6.days.ago.to_date..Date.current).map do |date|
      day_meals = current_user.meals.on_date(date).includes(meal_foods: :food)