app/controllers/recipes_controller.rb

SELECT 1 AS one FROM "recipes" WHERE "recipes"."user_id" = 2 LIMIT 1
---
  def index
    @recipes = current_user.recipes.order(created_at: :desc)
    @recipes = @recipes.search(params[:q]) if params[:q].present?