app/controllers/registrations_controller.rb

  def create
    @user = User.new(registration_params)

    if @user.save
---
INSERT INTO "users" ("email_address", "password_digest", "created_at", "updated_at", "height", "weight", "age", "gender", "fitness_goal", "activity_level", "daily_calorie_goal", "protein_goal", "carb_goal", "fat_goal") VALUES ('chris@gmail.com', '$2a$12$VOE.wbOVU5ZY/.xA2P.D0ervAmhlifgqR3kuciTnPxB9dEmQxnaSq', '2026-02-08 11:58:25.610722', '2026-02-08 11:58:25.610722', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL) RETURNING "id"