app/views/exercises/index.html.erb

      <div class="md:col-span-4 flex items-center justify-between">
        <div class="text-sm text-gray-500"><%= pluralize(@exercises.size, "exercise") %></div>
---
SELECT COUNT(*) FROM "exercises"